In [1]:
import pandas as pd

In [2]:
stocks = pd.read_csv('http://bit.ly/smallstocks')

In [3]:
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

#### This is a single index dataframe with index: ####

In [4]:
stocks.index

RangeIndex(start=0, stop=9, step=1)

## I will create multi index series using group by ##

In [5]:
ser = stocks.groupby(['Symbol','Date']).Close.mean()
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

## A 2-index series is similar to a dataframe as it is accessible in 2D. ##
This series above has 2 indexes, named as Symbol and Date. The indexes, if viewed are tuples. <br>
We can access each row from a multi-indexed series using loc

In [6]:
ser.index

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

# Accessing data #

In [7]:
ser.loc[('AAPL')]

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [8]:
ser.loc[('AAPL', '2016-10-03')]

112.52

In [9]:
ser.loc[(['AAPL', 'CSCO'], ['2016-10-03', '2016-10-04'])]

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
CSCO    2016-10-03     31.50
        2016-10-04     31.35
Name: Close, dtype: float64

We can convert 2-index series into a

# Multi Index Data Frames #

In [10]:
multi_ind = stocks.set_index(['Symbol', 'Date'])

In [11]:
multi_ind

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

# Accessing data #

In [12]:
multi_ind.loc[('CSCO'), :]

            Close    Volume
Date
2016-10-03  31.50  14070500
2016-10-04  31.35  18460400
2016-10-05  31.59  11808600

In [30]:
multi_ind.loc[('CSCO', '2016-10-03')]

Close           31.5
Volume    14070500.0
Name: (CSCO, 2016-10-03), dtype: float64

In [31]:
multi_ind.loc[(['CSCO', 'AAPL']), :]

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100

In [50]:
multi_ind.loc[(['AAPL', 'CSCO'], ['2016-10-03','2016-10-04']), 'Close']

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
CSCO    2016-10-03     31.50
        2016-10-04     31.35
Name: Close, dtype: float64

In [51]:
type(multi_ind.loc[(['AAPL', 'CSCO'], ['2016-10-03','2016-10-04']), 'Close'])

pandas.core.series.Series

In [59]:
multi_ind.index.get_level_values(0)    ## it returns the index values at particular level (This is a 2 level index, so has levels 0 and 1)

Index(['CSCO', 'AAPL', 'MSFT', 'AAPL', 'MSFT', 'CSCO', 'MSFT', 'CSCO', 'AAPL'], dtype='object', name='Symbol')